#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Eduard
#
# Created:     06.06.2019
# Copyright:   (c) Eduard 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    pass

if __name__ == '__main__':
    main()

list1 = ["Рыжая", "лиса", "перепрыгнула", "через", "низкий", "забор", "."]

list1[5] = list1[5]+list1[6]
list1.pop()

str1 = " ".join(list1)

print(str1)

fox = ["Рыжая", "лиса", "перепрыгнула", "через", "низкий", "забор", "."]
fox = " ".join(fox)
fox = fox[0:-2]+"."
print(fox)