#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      Eduard
#
# Created:     06.06.2019
# Copyright:   (c) Eduard 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------

def main():
    pass

if __name__ == '__main__':
    main()
str1 = "Роберт повернулся и сказал ей: 'Привет'."
str2 = "Роберт повернулся и сказал ей: \"Привет\"."
str3 = 'Роберт повернулся и сказал ей: "Привет".'

print(str1+"\n"+str2+"\n"+str3)